#include <stdio.h>
#include <stdlib.h>
#include "myhead.h"

void check(int(*ip)[3]) {
	if ((ip[0][0] == 1 && ip[0][1] == 1 && ip[0][2] == 1) ||
		(ip[1][0] == 1 && ip[1][1] == 1 && ip[1][2] == 1) ||
		(ip[2][0] == 1 && ip[2][1] == 1 && ip[2][2] == 1) ||

		(ip[0][0] == 1 && ip[1][0] == 1 && ip[2][0] == 1) ||
		(ip[0][1] == 1 && ip[1][1] == 1 && ip[2][1] == 1) ||
		(ip[0][2] == 1 && ip[1][2] == 1 && ip[2][2] == 1) ||

		(ip[0][0] == 1 && ip[1][1] == 1 && ip[2][2] == 1) ||
		(ip[0][2] == 1 && ip[1][1] == 1 && ip[2][0] == 1)) {
		draw_board(ip);    //시스템 종료전에 최종 board출력
		printf("컴퓨터 승리\n");
		exit(0);}

	if ((ip[0][0] == 2 && ip[0][1] == 2 && ip[0][2] == 2) ||
		(ip[1][0] == 2 && ip[1][1] == 2 && ip[1][2] == 2) ||
		(ip[2][0] == 2 && ip[2][1] == 2 && ip[2][2] == 2) ||

		(ip[0][0] == 2 && ip[1][0] == 2 && ip[2][0] == 2) ||
		(ip[0][1] == 2 && ip[1][1] == 2 && ip[2][1] == 2) ||
		(ip[0][2] == 2 && ip[1][2] == 2 && ip[2][2] == 2) ||

		(ip[0][0] == 2 && ip[1][1] == 2 && ip[2][2] == 2) ||
		(ip[0][2] == 2 && ip[1][1] == 2 && ip[2][0] == 2)) {
		draw_board(ip);    //시스템 종료전에 최종 board출력
		printf("인간 승리\n");
		exit(0);
	}
	int checkGameOver = 0;
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 3; j++) {
			if (ip[i][j] != 0)
				checkGameOver++;
		}
	}
	if (checkGameOver == 9) {
		draw_board(ip);
		printf("무승부\n");
		exit(0);
	}	
}